# Створіть функцію <morse_code>, яка приймає на вхід рядок у вигляді коду Морзе
# та виводить декодоване значення (латинськими літерами).
#    Особливості:
#     - використовуються лише крапки, тире і пробіли (.- )
#     - один пробіл означає нову літеру
#     - три пробіли означають нове слово
#     - результат може бути case-insensetive (на ваш розсуд - велики чи маленькими літерами).
#     - для простоти реалізації - цифри, знаки пунктуацїї, дужки, лапки тощо використовуватися не будуть. Лише латинські літери.
#     - додайте можливість декодування сервісного сигналу SOS (...---...)
#     Приклад:
#     --. . . -.- .... ..- -...   .. ...   .... . .-. .


MESSAGE = "--. . . -.- .... ..- -...   .. ...   .... . .-. ."


MORSE_CODE_DICT = {
    '.-': 'A',
    '-...': 'B',
    '-.-.': 'C',
    '-..': 'D',
    '.': 'E',
    '..-.': 'F',
    '--.': 'G',
    '....': 'H',
    '..': 'I',
    '.---': 'J',
    '-.-': 'K',
    '.-..': 'L',
    '--': 'M',
    '-.': 'N',
    '---': 'O',
    '.--.': 'P',
    '--.-': 'Q',
    '.-.': 'R',
    '...': 'S',
    '-': 'T',
    '..-': 'U',
    '...-': 'V',
    '.--': 'W',
    '-..-': 'X',
    '-.--': 'Y',
    '--..': 'Z',
    '...---...': 'SOS',
}


def morse_code(morse_message):
    words_list = morse_message.split('   ')
    decoded_words_list = []

    for word in words_list:
        decoded_words_list.append(
            ''.join(list(map(lambda letter: MORSE_CODE_DICT[letter], word.split(' ')))))

    return ' '.join(decoded_words_list)


if __name__ == "__main__":
    print(morse_code(MESSAGE))
